In [2]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
# read_csv()----------------- Used to read data from a CSV file and create a DataFrame.
df=pd.read_csv('titanic.csv')

In [3]:
# head()---------------------Returns the first n rows of the DataFrame (by default, n=5).
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# groupby()-------------------Used for grouping data based on one or more columns.
group_data=df.groupby('Sex')
group_data.get_group('male')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [5]:
# describe() function is used to generate descriptive statistics of a DataFrame. 
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [9]:
# loc and iloc----------------------Access specific rows and columns using labels or indices.
df.iloc[0:2, 0:2]

   PassengerId  Survived
0            1         0
1            2         1

In [11]:
df.loc[0:2, ['PassengerId', 'Survived']]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [32]:
data = {'A': [10, 20, 30, 40],
        'B': [11, 22, 33, 44],
        'C': [12, 24, 36, 48]}

df=pd.DataFrame(data)
n=len(df)
indx =[]

for i in range(1,2*n+1,2):
    indx.append(i)
    
df.index=indx
df

    A   B   C
1  10  11  12
3  20  22  24
5  30  33  36
7  40  44  48

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [47]:
data={'Values':[10,20,40,30,60]}
df=pd.DataFrame(data)

def Find_sum(df):
    sum=df['Values'][:3].sum()
    print("Sum is ",sum)

Find_sum(df)

Sum is  70

Q4. Given a Pandas DataFrame df with a column 'Text', 
write a Python function to create a new column 'Word_Count' 
that contains the number of words in each row of the 'Text' column.

In [52]:
data={'Text':['Nikhil Thakur Prasad Mishra','Krishna Yadav','Ram Singh']}
df=pd.DataFrame(data)

def Count(df):
    count = lambda text:len(str(text).split()) #-------counts words
    df['Word_Count']=df['Text'].apply(count)
    print(df)


Count(df)

                          Text  Word_Count
0  Nikhil Thakur Prasad Mishra           4
1                Krishna Yadav           2
2                    Ram Singh           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [54]:
df

                          Text  Word_Count
0  Nikhil Thakur Prasad Mishra           4
1                Krishna Yadav           2
2                    Ram Singh           2

In [53]:
"""
DataFrame.size returns the total number of elements in the DataFrame, which is equal
to the number of rows multiplied by the number of columns.
"""
df.size

6

In [55]:
"""
DataFrame.shape returns a tuple representing the dimensions of the DataFrame.
It provides the number of rows and the number of columns in the DataFrame.
The attribute returns a tuple (rows, columns).
"""
df.shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

=> pd.read_excel("Filename") is used to read excel file in pandas

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [7]:

data = {'Email': ['nikhil@example.com', 'ram@yahoo.com', 'pw@domain.com']}
df2 = pd.DataFrame(data)

df2['Username'] = df2['Email'].apply(lambda Email: Email.split('@')[0])
df2

                Email Username
0  nikhil@example.com   nikhil
1       ram@yahoo.com      ram
2       pw@domain.com       pw

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [11]:
data={
    "A":[2,3,5,7,8,6,9],
    "B":[4,2,5,6,7,5,7],
    "C":[1,3,45,53,53,3,4]
}
df4=pd.DataFrame(data)
df4

   A  B   C
0  2  4   1
1  3  2   3
2  5  5  45
3  7  6  53
4  8  7  53
5  6  5   3
6  9  7   4

In [12]:

def new(DataFrame):
    return df4[(df4['A'] > 5) & (df4['B'] < 10)]

new(df4)

   A  B   C
3  7  6  53
4  8  7  53
5  6  5   3
6  9  7   4

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [22]:
data={"Values":[34,34,2,432,22,231,1223,421]}
df5=pd.DataFrame(data)
df5.describe()

            Values
count     8.000000
mean    299.875000
std     413.410014
min       2.000000
25%      31.000000
50%     132.500000
75%     423.750000
max    1223.000000

In [23]:
def func(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    dic={"Mean": mean, "Median": median, "Std": std}
    return dic
func(df5)

{'Mean': 299.875, 'Median': 132.5, 'Std': 413.41001352859644}

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [24]:
def calculate_moving_average(df):
    
    df.sort_values(by='Date', inplace=True)


    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()


data = {'Date': ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05', '2023-07-06', '2023-07-07', '2023-07-08', '2023-07-09', '2023-07-10'],
        'Sales': [100, 120, 150, 110, 130, 140, 180, 200, 160, 170]}

df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])

calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2023-07-01    100     100.000000
1 2023-07-02    120     110.000000
2 2023-07-03    150     123.333333
3 2023-07-04    110     120.000000
4 2023-07-05    130     122.000000
5 2023-07-06    140     125.000000
6 2023-07-07    180     132.857143
7 2023-07-08    200     147.142857
8 2023-07-09    160     152.857143
9 2023-07-10    170     155.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [29]:

data = {'Date': ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05']}
df = pd.DataFrame(data)

df['Date'] = pd.to_datetime(df['Date'])
df['weekday']=df.apply(lambda x : x.dt.day_name())
print(df)

        Date    weekday
0 2023-07-01   Saturday
1 2023-07-02     Sunday
2 2023-07-03     Monday
3 2023-07-04    Tuesday
4 2023-07-05  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [33]:
data = {'Date': ['2023-01-10', '2023-01-26', '2023-01-31', '2023-02-17', '2023-06-20']}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
df

        Date
0 2023-01-10
1 2023-01-26
2 2023-01-31
3 2023-02-17
4 2023-06-20

In [34]:
filtered =  df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
filtered

        Date
0 2023-01-10
1 2023-01-26
2 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.
syntax :
 import pandas